Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/index.html.txt.tmx
Source language: en
Languages: ga

source: Claiming a social welfare payment
ga: Íocaíocht Leasa Shóisialaigh a Éileamh

source: Explains how to claim a social welfare payment and where you can get help to fill out the application form
ga: Déanann sé cur síos ar an gcaoi ina déantar iarratas ar íocaíocht leasa shóisialaigh agus cá háit a gheobhaidh tú cabhair chun an fhoirm iarratais a chomlíonadh

source: Claiming for a child dependant
ga: Ag éileamh do chleithiúnaí linbh

source: You can get an increase in your social welfare payment for a child dependant
ga: D'fhéadfá ardú breise ar d'íocaíocht phearsanta a fháil do leanbh cleithiúnaí

source: This document explains when you can claim an Increase for a Qualified Child (IQC)
ga: Déanann an doiciméad seo cur síos air/uirthi a bheith cáilithe mar leanbh cleithiúnaí

source: Claiming for an adult dependant
ga: Ag éileamh do chleithiúnaí aosaigh

source: You can get an increase in your social welfare payment for your adult dependant
ga: Tá méid breise a fháil do chleithiúnaí aosaigh mar ardú ar d'íocaíocht phearsanta

source: This document explains who qualifies as an adult dependant
ga: Déanann an doiciméad seo cur síos air/uirthi a bheith cáilithe mar cleithiúnaí aosaigh

source: Making a late claim
ga: Éileamh a chur isteach go déanach

source: You must claim a social welfare payment within the time limits set by the Department
ga: Caithfidh tú íocaíocht leasa shóisialaigh a éileamh laistigh de na teorainneacha ama atá leagtha síos ag an Roinn

source: This document explains the time limits for social welfare payments and when you may have a payment back-dated to the time you became entitled to it
ga: Míníonn an cháipéis seo na teorainneacha ama le haghaidh íocaíochtaí leasa shóisialaigh agus nuair a fhéadfadh tú siardhátú a fháil ar íocaíocht go dtí an t-am a raibh tú i dteideal í

source: Taxation of social welfare payments
ga: Gearradh cánach ar íocaíochtaí leasa shóisialaigh

source: Social welfare payments may or may not be deemed taxable in Ireland
ga: Bíodh sin mar atá, d'fhéadfadh d'íocaíocht leasa shóisialaigh a bheith inchánaithe nó saor ó cháin in Éirinn

source: Information about how which social welfare payments are taxable and how they are taxed
ga: Faigh amach na rialacha canachais na n-íocaíochtaí leasa shóisialaigh

source: Changes that can affect your social welfare payment
ga: Athruithe ar féidir tionchar a bheith acu ar d'íocaíocht leasa shóisialaigh

source: A change in your circumstances can affect your entitlement to a social welfare payment
ga: D'fhéadfá athrú i do chúinsí pearsanta difear a dhéanamh ar d'íocaíocht leasa shóisialaigh

source: This document gives some examples of the changes that can affect your social welfare payment
ga: Tá roinnt samplaí sa doiciméid seo den athruithe a fhéadfádh difear a dhéanamh ar d'íocaíocht leasa shóisialaigh

source: Claiming an extra half-rate social welfare payment
ga: Ag éileamh íocaíocht leasa shóisialaigh bhreise ar leathráta

source: It is generally only possible to claim one social welfare assistance or insurance based payment at a time
ga: Go hiondúil ní féidir ach íocaíocht chúnaimh leasa shóisialaigh nó íocaíocht bunaithe ar árachas amháin a éileamh ag aon uair amháin

source: However, in certain circumstances you may qualify for your social welfare payment and half of another payment
ga: Mar sin féin, i gcúinsí áirithe féadann tú a bheith i dteideal d'íocaíocht leasa shóisialaigh a fháil in éineacht le leath íocaíocht leasa shóisialaigh eile

source: Recovery of social welfare overpayments
ga: Aisghabháil íocaíochtaí iomarcacha leasa shóisialaigh

source: The Department of Social Protection recoups overpayments in social welfare benefits and entitlements in Ireland
ga: Faigheann an Roinn Coimirce Sóisialaí íocaíochtaí iomarcacha sochar agus cearta leasa shóisialaigh ar ais in Éirinn

source: Find out how overpayments are collected
ga: Faigh amach cén chaoi a mbailítear íocaíochtaí iomarcacha

source: The Household Budget Scheme aims to help those getting certain social welfare payments to spread the cost of household bills throughout the year
ga: Tá sé mar aidhm ag an Scéim Bhuiséadta Teaghlaigh cabhrú leo siúd a fhaigheann íocaíochtaí leasa shóisialaigh áirithe le costas a mbillí tí a roinnt amach le linn na bliana uilig

source: Find out if you qualify and how to apply
ga: Faigh amach an gcáilíonn tú agus conas iarratas a dhéanamh

source: Going abroad or on holidays and social welfare payments
ga: Ag dul thar lear chun bheith i do chónaí nó ar laethanta saoire agus íocaíochtaí leasa shóisialaigh

source: Outlines the social welfare payments that will continued to be paid if you go abroad
ga: Is féidir leat leanúint ag fáil íocaíochtaí leasa shóisialaigh má tá tú ag imeacht thar lear

source: It also lists the payments that will not be paid if you go abroad
ga: Ní íocfar íocaíochtaí cúnaimh shóisialta fiú amháin má tá tú ag imeacht thar lear

source: How social welfare payments are paid
ga: Athsholáthar leabhar leasa shóisialaigh nó Cárta Seirbhísí Sóisialacha

source: Find out how social welfare payments are paid
ga: Treoir ar athsholáthair leabhar íocaíochta leasa shóisialaigh nó Cárta Seirbhísí Sóisialacha a cailleadh nó goideadh

source: Combining social insurance contributions from abroad
ga: Ranníocaíochtaí árachais shóisialta ón choigríoch a chomhcheangal

source: Combining social insurance contributions paid in Ireland and abroad can help you qualify for a social welfare payment
ga: Is féidir le comhcheangail do chuid íocaíochtaí arachais sóisialta a íocadh in Éirinn agus thar lear a chuidiú leat bheith incháilithe d'íocaíocht leasa sóisialta

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
